<?php 
	echo "<h2>Список книг и авторов:</h2>";

	$booksList = array(
		"451° по Фаренгейту" => "Рей Брэдбери",
		"Цветы для Элджернона" => "Даниел Киз",
		"Шантарам" => " Грегори Дэвид Робертс",
		"Над пропастью во ржи" => "Джером Д. Сэлинджер",
		1984 => "Джордж Оруэлл ",
		"Маленький принц" => "Антуан де Сент-Экзюпери",
		"Мастер и Маргарита" => "Михаил Афанасьевич Булгаков",
		"Анна Каренина" => "Лев Толстой",
		"Три товарища" => "Эрих Мария Ремарк",
		"Сто лет одиночества" => "Габриэль Гарсиа Маркес",
		"Портрет Дориана" => "Грея Оскар Уайльд",
		"Тень горы" => "Грегори Дэвид Робертс",
		"Вино из одуванчиков" => "Рей Брэдбери",
		"Атлант расправил плечи" => "Айн Рэнд"
	);
	echo "<ul>";
	foreach ($booksList as $books => $author) {
		echo "<li><b>Автор:</b> $books, <b>Книга:</b> $author . </li>";
	}
	echo "</ul>";


		
?>